[{"name":"app.R","content":"# Task Name: Experiment_Quasiexperiment_Nichtexperiment ######################\n\nlibrary(shiny)\nlibrary(shinyjs)\nlibrary(dplyr)\nlibrary(learnr)\nlibrary(bslib)\nlibrary(shinycssloaders)\n\n\n\n## UI #########################################################################\nui <- page_fixed(\n  useShinyjs(),\n  card(\n    card(\n      card_header(\n        \"Aufgabe: Untersuchungsdesign in Studienbeschreibung erkennen\",\n        class = \"bg-dark\"),\n    card_body(\n      htmlOutput(\"prompt_task\")\n    )\n    ),\n    \n    \n    shinyjs::hidden(card(id = \"feedbackpanel_task\",\n                         card_header(\n                           \"Feedback\",\n                           class = \"bg-dark\"),\n                         card_body(\n                           withSpinner(\n                             htmlOutput(\"feedback_task\"),\n                             proxy.height = \"50px\",\n                             color = \"#8cd000\"))\n    )\n    ),\n    card(\n      uiOutput(\"ui_answers_task\"),\n      actionButton(\"show_feedback_task\", \n                   \"Prüfe meine Lösung!\",\n                   icon = icon(\"microscope\")),\n      actionButton(\"reshuffle_task\", \n                   \"Diese Aufgabe wiederholen\",\n                   icon = icon(\"repeat\")),\n      actionButton(\"new_task\", \n                   \"Neue Aufgabe derselben Art\",\n                   icon = icon(\"plus-circle\"))\n    )      \n  ))\n\n\n\nserver <- function(input, output, session) {\n\n  ##############################################################################\n  # Backend for task  ##########################################################\n  ##############################################################################\n  \n  # The global logic is to create a tibble containing  \n  #      - answers & distractors (column 1)\n  #      - questions (headers of columns 2 - m)\n  #      - correct solutions (columns 2 - m without headers)\n  #\n  # Then \n  #     - reshuffle columns (without the first) to randomize order of questions\n  #     - reshuffle rows to randomize order of answers & distractors\n  \n  \n  ## Parameter solution matrix for task  ####\n  q_a_matrix_qshuffeled <- \n    tibble(\n      Answers_and_Distractors = c(\"Eine experimentelle Studie\",\n                                  \"Eine quasi-experimentelle Studie\",\n                                  \"Eine nicht-experimentelle Studie\"),\n      `Es soll untersucht werden, welchen Zusammenhang es zwischen Pausen beim Lernen und der Lernleistung gibt. Dazu werden die Studierenden eines Seminars während ihrer Lernzeit beobachtet. Es wird registriert, wie viel Zeit sie für das Lernen der Inhalte aufwenden und wie viele Lernpausen sie machen. Die Lernleistung wird anhand der erreichten Punktzahl in einer Abschlussklausur bewertet.` =  c(F,F,T), # adjust line 132 if coded 0/1 #1\n      `Es soll untersucht werden, welchen Zusammenhang es zwischen Pausen beim Lernen und der Lernleistung gibt. Dazu werden Studentinnen und Studenten eines Seminars miteinander verglichen. Die Studentinnen werden aufgefordert nach jeweils 30 Minuten Lernzeit eine Pause von 5 Minuten einzulegen. Die Studenten sollen die Zeit ohne Unterbrechung zum Lernen nutzen. Zusätzlich wird die Lernzeit erfasst. Die Lernleistung wird anhand der erreichten Punktzahl in einer Abschlussklausur bewertet.` =  c(F,T,F), #2\n      `Es soll untersucht werden, welchen Zusammenhang es zwischen Pausen beim Lernen und der Lernleistung gibt. Dazu werden die Studierenden in einem Seminar zufällig in zwei Gruppen zugeteilt. Die Gesamtlernzeit wird für beide Gruppen auf 3 h begrenzt. Gruppe 1 soll nach jeweils 30 Minuten eine Pause von 5 Minuten machen, Gruppe 2 soll die Zeit ohne Unterbrechung zum Lernen nutzen. Die Lernleistung wird anhand der erreichten Punktzahl in einer Abschlussklausur bewertet.` =  c(T,F,F),#3\n      `Der Ankereffekt tritt ein, wenn Menschen mit neuen Informationen (z. B. Zahlenwerten) konfrontiert werden, die sie unbewusst als Anker nutzen, um daran ihre eigene Einschätzung zu orientieren. Es soll untersucht werden, ob die Zweitkorrektur von Abituraufsätzen im Fach Deutsch durch den Ankereffekt verfälscht wird, wenn die Erstkorrekturnote bekannt ist. Dazu werden in einer repräsentative Stichprobe von Deutschlehrkräften die gleichen fünf Deutschaufsätze samt Erstkorrektur mit der Bitte um Zweitkorrektur vorgelegt. Anschließend beantworten die Lehrkräfte in einem standardisierten Fragebogen, ob sie bei der Beurteilung von der Erstkorrektur beeinflusst wurden.` =  c(F,F,T), #4\n      `Der Ankereffekt tritt ein, wenn Menschen mit neuen Informationen (z. B. Zahlenwerten) konfrontiert werden, die sie unbewusst als Anker nutzen, um daran ihre eigene Einschätzung zu orientieren. Es soll untersucht werden, ob die Zweitkorrektur von Abituraufsätzen im Fach Deutsch durch den Ankereffekt verfälscht wird, wenn die Erstkorrekturnote bekannt ist. Dazu werden Lehrer*innen zufällig in zwei Experimentalgruppen eingeteilt. Eine Gruppe erhält Deutschaufsätze mit einer angeblich guten Erstkorrekturnote (Note 2). Die andere Gruppe erhält dieselben Deutschaufsätze jedoch unter Angabe einer schlechten Erstkorrekturnote (Note 5). Es wird untersucht, ob eine bessere Note für Arbeiten mit der angeblichen guten Erstkorrekturnote als mit der angeblich schlechten Erstkorrekturnote vergeben werden.` =  c(T,F,F),#5\n      `Der Ankereffekt tritt ein, wenn Menschen mit neuen Informationen (z. B. Zahlenwerten) konfrontiert werden, die sie unbewusst als Anker nutzen, um daran ihre eigene Einschätzung zu orientieren. Es soll untersucht werden, ob die Zweitkorrektur von Abituraufsätzen im Fach Deutsch durch den Ankereffekt verfälscht wird, wenn die Erstkorrekturnote bekannt ist. Der Einfachheit halber bilden die Lehrkräfte an Schule A die eine Experimentalgruppe und die Lehrkräfte an Schule B die zweite Experimentalgruppe. Eine Gruppe erhält Deutschaufsätze mit einer angeblich guten Erstkorrekturnote (Note 2). Die andere Gruppe erhält dieselben Deutschaufsätze jedoch unter Angabe einer schlechten Erstkorrekturnote (Note 5). Es wird untersucht, ob eine bessere Note für Arbeiten mit der angeblichen guten Erstkorrekturnote als mit der angeblich schlechten Erstkorrekturnote vergeben werden.` =  c(F,T,F),#6\n      `Es sollen genauere Erkenntnisse darüber gewonnen werden, wie sich die Stressbewältigung bei Lehrkräften verbessern lässt. Dazu werden umfangreiche Fragebögen zu Persönlichkeitsmerkmalen, Wissen zu Stressbewältigungsstrategien sowie eigenem Stressempfinden bei Lehrkräften mit und ohne vorherige Burnout-Diagnose miteinander verglichen.` =  c(F,F,T),#7\n      `Es sollen genauere Erkenntnisse darüber gewonnen werden, wie sich die Stressbewältigung bei Lehrkräften verbessern lässt. Dazu werden aus einem Pool interessierter Lehrkräfte zufällig 30 Personen ausgewählt und zu einem Stressbewältigungstraining eingeladen. Die nicht eingeladenen Lehrkräfte wurden als Kontrollgruppe genutzt. Beim Training wird umfangreiches Wissen zur Entstehung von Stress und zu Stressbewältigungsstrategien angeboten und in kleineren Gruppenübungen vertieft. Längsschnittlich werden die Teilnehmenden zu ihrem eigenen Stressempfinden im Beruf befragt und mit der Kontrollstichprobe verglichen.` =  c(T,F,F),#8\n      `Es sollen genauere Erkenntnisse darüber gewonnen werden, wie sich die Stressbewältigung bei Lehrkräften verbessern lässt. Dazu wird auf einer Fortbildung zum Thema Burnout für alle Teilnehmenden ein Stressbewältigungstraining in Kleingruppen durchgeführt. Die Kontrollstichprobe wurde auf einer Fortbildung für Inklusion für die Studie ausgewählt. Längsschnittlich werden die Teilnehmenden anschließend zu ihrem eigenen Stressempfinden im Beruf befragt und mit der Kontrollstichprobe verglichen.` =  c(F,T,F)) %>% #9\n    # shuffle order of questions\n    relocate(1, 2, sample(3:ncol(.), ncol(.) - 2))\n  \n  ## Number of \n  \n  ## Shuffle answers\n  q_a_matrix_qashuffeled <- \n    reactive({\n      input$reshuffle_task # answer shuffelling induced by both buttons\n      input$new_task\n      \n      q_a_matrix_qshuffeled %>%\n        sample_frac(., size = 1)\n    })\n  \n  ## Select task \n  nth_task <- reactive({\n    # starting with 1\n    (as.numeric(input$new_task) %% (ncol(q_a_matrix_qshuffeled) - 1)) + 1\n  })\n  \n  \n  ## Render UI for Answers ###\n  output$ui_answers_task <- renderUI({\n    input$reshuffle_task\n    input$new_task\n    radioButtons(\n      \"answers_task\",\n      \"Bitte ankreuzen\",\n      q_a_matrix_qashuffeled() %>% \n        select(1, nth_task() + 1) %>% \n        na.omit(.) %>% \n        pull(Answers_and_Distractors),\n      selected = character(0)\n    )\n  })\n  \n  ## Prompt task \n  output$prompt_task <- renderText({\n    paste(names(q_a_matrix_qashuffeled())[2:ncol(q_a_matrix_qshuffeled)][nth_task()],\n          \"<br><b>Welches Untersuchungsdesign liegt vor?<\/b>\")\n  }) \n  \n  ## Correct answers ###\n  correct_answers_task <- reactive({\n    \n    vector_of_correct_answers <- \n      q_a_matrix_qashuffeled() %>% \n      pull(nth_task() + 1)\n    \n    correct_answers_task <- \n      q_a_matrix_qashuffeled() %>%\n      filter(vector_of_correct_answers == T) %>%\n      pull(Answers_and_Distractors)\n    \n    return(correct_answers_task)\n  })\n  \n  ## Feedback task  ####\n  output$feedback_task <- renderText({   \n    \n    if(is.null(input$answers_task)){\n      HTML(paste(\"<b>Leider nicht korrekt!<\/b> Richtig wäre:  <br>✓ \", \n                 paste(correct_answers_task(), collapse = \", <br>✓ \"),\n                 \"<br><i>\",\n                 learnr::random_encouragement(),\n                 \"<\/i>\"))\n    }else{\n      if(setequal(correct_answers_task(), input$answers_task)){\n        paste(\"Richtig!\", learnr::random_praise())}else{\n          HTML(paste(\"<b>Leider nicht korrekt!<\/b> Richtig wäre:  <br>✓ \", \n                     paste(correct_answers_task(), collapse = \", <br>✓ \"),\n                     \"<br><i>\",\n                     learnr::random_encouragement(),\n                     \"<\/i>\"))\n        }\n    }\n  })\n  \n  ## Show and Hide Feedback ####################################################\n  ## Show feedback on button click \n  observeEvent(input$show_feedback_task, {\n    showElement(id = \"feedbackpanel_task\")\n  })\n  \n  ## Hide feedback on solution change or new plot type\n  observeEvent(c(input$answers_task, input$new_task), {\n    hideElement(id = \"feedbackpanel_task\")\n  })\n  \n  ## Reset answer on new plot type\n  observeEvent(c(input$reshuffle_task, input$new_task), {\n    reset(id = \"answers_task\")\n  })\n\n}\n\n\n\n# Create Shiny object\nshinyApp(ui = ui, server = server)\n","type":"text"}]
